Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32L476G-DISCO.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                            |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |USART1|USART2|USART3|ADC1 |TIM (PWM)                                  |USB       |RCC       |SYS        
PA0 , // |JOY_CENTER [MT-008A_CENTER]            |    |    |    |     |     |     |      |      |      |*IN5 |*TIM2_CH1 *TIM5_CH1                        |          |          |           
PA1 , // |JOY_LEFT [MT-008A_LEFT]                |    |    |    |     |     |     |      |      |      |*IN6 |*TIM2_CH2 *TIM5_CH2 *TIM15_CH1N            |          |          |           
PA2 , // |JOY_RIGHT [MT-008A_RIGHT]              |    |    |    |     |     |     |      |*TX   |      |*IN7 |*TIM2_CH3 *TIM5_CH3 *TIM15_CH1             |          |          |           
PA3 , // |JOY_UP [MT-008A_UP]                    |    |    |    |     |     |     |      |*RX   |      |*IN8 |*TIM2_CH4 *TIM5_CH4 *TIM15_CH2             |          |          |           
PA4 , // |MFX_WAKEUP [MFX_V2_WAKEUP]             |    |    |    |     |     |     |      |      |      |*IN9 |                                           |          |          |           
PA5 , // |JOY_DOWN [MT-008A_DOWN]                |    |    |    |*SCK |     |     |      |      |      |*IN10|*TIM8_CH1N +TIM2_CH1                       |          |          |           
PA6 , // |SEG23 [GH08172T_SEG23]                 |    |    |    |*MISO|     |     |      |      |      |*IN11|+TIM3_CH1 *TIM16_CH1                       |          |          |           
PA7 , // |SEG0 [GH08172T_SEG0]                   |    |    |    |*MOSI|     |     |      |      |      |*IN12|+TIM8_CH1N +TIM3_CH2 *TIM1_CH1N *TIM17_CH1 |          |          |           
PA8 , // |COM0 [GH08172T_COM0]                   |    |    |    |     |     |     |      |      |      |     |+TIM1_CH1                                  |          |          |           
PA9 , // |COM1 [GH08172T_COM1]                   |    |    |    |     |     |     |*TX   |      |      |     |+TIM1_CH2                                  |          |          |           
PA10, // |COM2 [GH08172T_COM2]                   |    |    |    |     |     |     |*RX   |      |      |     |+TIM1_CH3                                  |          |          |           
PA11, // |OTG_FS_DM [EMIF02-USB03F2_D-out]       |    |    |    |     |     |     |      |      |      |     |+TIM1_CH4                                  |*OTG_FS_DM|          |           
PA12, // |OTG_FS_DP [EMIF02-USB03F2_D+out]       |    |    |    |     |     |     |      |      |      |     |                                           |*OTG_FS_DP|          |           
PA13, // |SWDIO                                  |    |    |    |     |     |     |      |      |      |     |                                           |          |          |*JTMS-SWDIO
PA14, // |SWCLK                                  |    |    |    |     |     |     |      |      |      |     |                                           |          |          |*JTCK-SWCLK
PA15, // |SEG10 [GH08172T_SEG10]                 |    |    |    |     |     |     |      |      |      |     |+TIM2_CH1                                  |          |          |*JTDI      
PB0 , // |SEG21 [GH08172T_SEG21]                 |    |    |    |     |     |     |      |      |      |*IN15|*TIM8_CH2N +TIM3_CH3 *TIM1_CH2N            |          |          |           
PB1 , // |SEG2 [GH08172T_SEG2]                   |    |    |    |     |     |     |      |      |      |*IN16|+LPTIM2_IN1 +TIM3_CH4 *TIM1_CH3N *TIM8_CH3N|          |          |           
PB2 , // |LD_R [LED red]                         |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PB3 , // |M3V3_REG-ON                            |    |    |    |+SCK |     |+SCK |      |      |      |     |+TIM2_CH2                                  |          |          |*JTDO-SWO  
PB4 , // |SEG11 [GH08172T_SEG11]                 |    |    |    |+MISO|     |+MISO|      |      |      |     |+TIM3_CH1                                  |          |          |*JTRST     
PB5 , // |SEG12 [GH08172T_SEG12]                 |    |    |    |+MOSI|     |+MOSI|      |      |      |     |+TIM3_CH2 +LPTIM1_IN1                      |          |          |           
PB6 , // |I2C1_SCL [SSM-104-L-DH_SCL]            |*SCL|    |    |     |     |     |+TX   |      |      |     |*TIM16_CH1N +TIM4_CH1                      |          |          |           
PB7 , // |I2C1_SDA [SSM-104-L-DH_SDA]            |*SDA|    |    |     |     |     |+RX   |      |      |     |*TIM17_CH1N +LPTIM1_IN2 +TIM4_CH2          |          |          |*PVD_IN    
PB8 , // |GYRO_INT2 [L3D20_DRDY/INT2]            |+SCL|    |    |     |     |     |      |      |      |     |+TIM16_CH1 +TIM4_CH3                       |          |          |           
PB9 , // |COM3 [GH08172T_COM3]                   |+SDA|    |    |     |     |     |      |      |      |     |+TIM17_CH1 +TIM4_CH4                       |          |          |           
PB10, // |MFX_I2C_SLC [MFX_V2_I2C_SCL]           |    |*SCL|    |     |*SCK |     |      |      |+TX   |     |+TIM2_CH3                                  |          |          |           
PB11, // |MFX_I2C_SDA [MFX_V2_I2C_SDA]           |    |*SDA|    |     |     |     |      |      |+RX   |     |+TIM2_CH4                                  |          |          |           
PB12, // |SEG20 [GH08172T_SEG20]                 |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PB13, // |SEG3 [GH08172T_SEG3]                   |    |+SCL|    |     |+SCK |     |      |      |      |     |+TIM1_CH1N +TIM15_CH1N                     |          |          |           
PB14, // |SEG19 [GH08172T_SEG19]                 |    |+SDA|    |     |+MISO|     |      |      |      |     |+TIM8_CH2N +TIM1_CH2N +TIM15_CH1           |          |          |           
PB15, // |SEG4 [GH08172T_SEG4]                   |    |    |    |     |+MOSI|     |      |      |      |     |+TIM1_CH3N +TIM8_CH3N +TIM15_CH2           |          |          |           
PC0 , // |                                       |    |    |*SCL|     |     |     |      |      |      |*IN1 |*LPTIM2_IN1 *LPTIM1_IN1                    |          |          |           
PC1 , // |MAG_INT [LSM303CTR_MAG_INT]            |    |    |*SDA|     |     |     |      |      |      |*IN2 |                                           |          |          |           
PC2 , // |MAG_DRDY [LSM303CTR_DRDY_MAG]          |    |    |    |     |*MISO|     |      |      |      |*IN3 |*LPTIM1_IN2                                |          |          |           
PC3 , // |VLCD                                   |    |    |    |     |*MOSI|     |      |      |      |*IN4 |                                           |          |          |           
PC4 , // |SEG22 [GH08172T_SEG22]                 |    |    |    |     |     |     |      |      |*TX   |*IN13|                                           |          |          |           
PC5 , // |SEG1 [GH08172T_SEG1]                   |    |    |    |     |     |     |      |      |*RX   |*IN14|                                           |          |          |           
PC6 , // |SEG14 [GH08172T_SEG14]                 |    |    |    |     |     |     |      |      |      |     |*TIM8_CH1 +TIM3_CH1                        |          |          |           
PC7 , // |SEG9 [GH08172T_SEG9]                   |    |    |    |     |     |     |      |      |      |     |*TIM8_CH2 +TIM3_CH2                        |          |          |           
PC8 , // |SEG13 [GH08172T_SEG13]                 |    |    |    |     |     |     |      |      |      |     |*TIM8_CH3 +TIM3_CH3                        |          |          |           
PC9 , // |OTG_FS_PowerSwitchOn [STMPS2141STR_EN] |    |    |    |     |     |     |      |      |      |     |*TIM8_CH4 +TIM3_CH4                        |          |          |           
PC10, // |OTG_FS_OverCurrent [STMPS2141STR_FAULT]|    |    |    |     |     |*SCK |      |      |+TX   |     |                                           |          |          |           
PC11, // |OTG_FS_VBUS [EMIF02-USB03F2_Vbus]      |    |    |    |     |     |*MISO|      |      |+RX   |     |                                           |          |          |           
PC12, // |                                       |    |    |    |     |     |*MOSI|      |      |      |     |                                           |          |          |           
PC13, // |MFX_IRQ_OUT [MFX_V2_IRQOUT]            |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PC14, // |                                       |    |    |    |     |     |     |      |      |      |     |                                           |          |*OSC32_IN |           
PC15, // |                                       |    |    |    |     |     |     |      |      |      |     |                                           |          |*OSC32_OUT|           
PD0 , // |EXT_RST [SSM-104-L-DH_EXT_RST]         |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD1 , // |MEMS_SCK [L3GD20_SCL/SPC]              |    |    |    |     |+SCK |     |      |      |      |     |                                           |          |          |           
PD2 , // |GYRO_INT1 [L3GD20_INT1]                |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD3 , // |MEMS_MISO [L3GD20_SA0/SDO]             |    |    |    |     |+MISO|     |      |      |      |     |                                           |          |          |           
PD4 , // |MEMS_MOSI [L3GD20_SDA/SDI/SDO]         |    |    |    |     |+MOSI|     |      |      |      |     |                                           |          |          |           
PD5 , // |USART_TX                               |    |    |    |     |     |     |      |+TX   |      |     |                                           |          |          |           
PD6 , // |USART_RX                               |    |    |    |     |     |     |      |+RX   |      |     |                                           |          |          |           
PD7 , // |GYRO_CS [L3GD20_CS_I2C/SPI]            |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD8 , // |SEG18 [GH08172T_SEG18]                 |    |    |    |     |     |     |      |      |+TX   |     |                                           |          |          |           
PD9 , // |SEG5 [GH08172T_SEG5]                   |    |    |    |     |     |     |      |      |+RX   |     |                                           |          |          |           
PD10, // |SEG17 [GH08172T_SEG17]                 |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD11, // |SEG6 [GH08172T_SEG6]                   |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PD12, // |SEG16 [GH08172T_SEG16]                 |    |    |    |     |     |     |      |      |      |     |+LPTIM2_IN1 *TIM4_CH1                      |          |          |           
PD13, // |SEG7 [GH08172T_SEG7]                   |    |    |    |     |     |     |      |      |      |     |*TIM4_CH2                                  |          |          |           
PD14, // |SEG15 [GH08172T_SEG15]                 |    |    |    |     |     |     |      |      |      |     |*TIM4_CH3                                  |          |          |           
PD15, // |SEG8 [GH08172T_SEG8]                   |    |    |    |     |     |     |      |      |      |     |*TIM4_CH4                                  |          |          |           
PE0 , // |XL_CS [LSM303CTR_CS_XL]                |    |    |    |     |     |     |      |      |      |     |+TIM16_CH1                                 |          |          |           
PE1 , // |XL_INT [LSM303CTR_INT_XL]              |    |    |    |     |     |     |      |      |      |     |+TIM17_CH1                                 |          |          |           
PE2 , // |SAI1_MCK [CS43L22_MCLK]                |    |    |    |     |     |     |      |      |      |     |                                           |          |          |*TRACECLK  
PE3 , // |AUDIO_RST [CS43L22_RESET]              |    |    |    |     |     |     |      |      |      |     |*TIM3_CH1                                  |          |          |*TRACED0   
PE4 , // |SAI1_FS [CS43L22_LRCK]                 |    |    |    |     |     |     |      |      |      |     |*TIM3_CH2                                  |          |          |*TRACED1   
PE5 , // |SAI1_SCK [CS43L22_SCLK]                |    |    |    |     |     |     |      |      |      |     |*TIM3_CH3                                  |          |          |*TRACED2   
PE6 , // |SAI1_SD [CS43L22_SDIN]                 |    |    |    |     |     |     |      |      |      |     |*TIM3_CH4                                  |          |          |*TRACED3   
PE7 , // |AUDIO_DIN [MP34DT01_DOUT]              |    |    |    |     |     |     |      |      |      |     |                                           |          |          |           
PE8 , // |LD_G [LED_Green]                       |    |    |    |     |     |     |      |      |      |     |+TIM1_CH1N                                 |          |          |           
PE9 , // |AUDIO_CLK [MP34DT01_CLK]               |    |    |    |     |     |     |      |      |      |     |*TIM1_CH1                                  |          |          |           
PE10, // |QSPI_CLK [N25Q128A13EF840E_C]          |    |    |    |     |     |     |      |      |      |     |+TIM1_CH2N                                 |          |          |           
PE11, // |QSPI_CS [N25Q128A13EF840E_S\#]         |    |    |    |     |     |     |      |      |      |     |*TIM1_CH2                                  |          |          |           
PE12, // |QSPI_D0 [N25Q128A13EF840E_DQ0]         |    |    |    |     |     |     |      |      |      |     |+TIM1_CH3N                                 |          |          |           
PE13, // |QSPI_D1 [N25Q128A13EF840E_DQ1]         |    |    |    |+SCK |     |     |      |      |      |     |*TIM1_CH3                                  |          |          |           
PE14, // |QSPI_D2 [N25Q128A13EF840E_DQ2]         |    |    |    |+MISO|     |     |      |      |      |     |*TIM1_CH4                                  |          |          |           
PE15, // |QSPI_D3 [N25Q128A13EF840E_DQ3]         |    |    |    |+MOSI|     |     |      |      |      |     |                                           |          |          |           
PH0 , // |                                       |    |    |    |     |     |     |      |      |      |     |                                           |          |*OSC_IN   |           
PH1 , // |                                       |    |    |    |     |     |     |      |      |      |     |                                           |          |*OSC_OUT  |           
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB11, GPIO_PIN_11, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD0 , GPIO_PIN_0 , GPIOD, GPIO_PIN_IO, false},
  { PD1 , GPIO_PIN_1 , GPIOD, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PD3 , GPIO_PIN_3 , GPIOD, GPIO_PIN_IO, false},
  { PD4 , GPIO_PIN_4 , GPIOD, GPIO_PIN_IO, false},
  { PD5 , GPIO_PIN_5 , GPIOD, GPIO_PIN_IO, false},
  { PD6 , GPIO_PIN_6 , GPIOD, GPIO_PIN_IO, false},
  { PD7 , GPIO_PIN_7 , GPIOD, GPIO_PIN_IO, false},
  { PD8 , GPIO_PIN_8 , GPIOD, GPIO_PIN_IO, false},
  { PD9 , GPIO_PIN_9 , GPIOD, GPIO_PIN_IO, false},
  { PD10, GPIO_PIN_10, GPIOD, GPIO_PIN_IO, false},
  { PD11, GPIO_PIN_11, GPIOD, GPIO_PIN_IO, false},
  { PD12, GPIO_PIN_12, GPIOD, GPIO_PIN_IO, false},
  { PD13, GPIO_PIN_13, GPIOD, GPIO_PIN_IO, false},
  { PD14, GPIO_PIN_14, GPIOD, GPIO_PIN_IO, false},
  { PD15, GPIO_PIN_15, GPIOD, GPIO_PIN_IO, false},
  { PE0 , GPIO_PIN_0 , GPIOE, GPIO_PIN_IO, false},
  { PE1 , GPIO_PIN_1 , GPIOE, GPIO_PIN_IO, false},
  { PE2 , GPIO_PIN_2 , GPIOE, GPIO_PIN_IO, false},
  { PE3 , GPIO_PIN_3 , GPIOE, GPIO_PIN_IO, false},
  { PE4 , GPIO_PIN_4 , GPIOE, GPIO_PIN_IO, false},
  { PE5 , GPIO_PIN_5 , GPIOE, GPIO_PIN_IO, false},
  { PE6 , GPIO_PIN_6 , GPIOE, GPIO_PIN_IO, false},
  { PE7 , GPIO_PIN_7 , GPIOE, GPIO_PIN_IO, false},
  { PE8 , GPIO_PIN_8 , GPIOE, GPIO_PIN_IO, false},
  { PE9 , GPIO_PIN_9 , GPIOE, GPIO_PIN_IO, false},
  { PE10, GPIO_PIN_10, GPIOE, GPIO_PIN_IO, false},
  { PE11, GPIO_PIN_11, GPIOE, GPIO_PIN_IO, false},
  { PE12, GPIO_PIN_12, GPIOE, GPIO_PIN_IO, false},
  { PE13, GPIO_PIN_13, GPIOE, GPIO_PIN_IO, false},
  { PE14, GPIO_PIN_14, GPIOE, GPIO_PIN_IO, false},
  { PE15, GPIO_PIN_15, GPIOE, GPIO_PIN_IO, false},
  { PH0 , GPIO_PIN_0 , GPIOH, GPIO_PIN_IO, false},
  { PH1 , GPIO_PIN_1 , GPIOH, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF5_SPI1,
    .mosi_port = GPIOA, 
    .mosi_pin =  GPIO_PIN_7, 
    .miso_alternate = GPIO_AF5_SPI1,
    .miso_port = GPIOA, 
    .miso_pin = GPIO_PIN_6, 
    .sck_alternate = GPIO_AF5_SPI1,
    .sck_port = GPIOA, 
    .sck_pin = GPIO_PIN_5, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF5_SPI2,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_3, 
    .miso_alternate = GPIO_AF5_SPI2,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_2, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_10, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI3, 
    .mosi_alternate = GPIO_AF6_SPI3,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_12, 
    .miso_alternate = GPIO_AF6_SPI3,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_11, 
    .sck_alternate = GPIO_AF6_SPI3,
    .sck_port = GPIOC, 
    .sck_pin = GPIO_PIN_10, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

i2c_init_info_t g_i2c_init_info[] = {
  {
    .init_done = 0,
    .i2c_instance = I2C1,
    .irq = I2C1_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C1,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_7,
    .scl_alternate = GPIO_AF4_I2C1,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_6,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C2,
    .irq = I2C2_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C2,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_11,
    .scl_alternate = GPIO_AF4_I2C2,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_10,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C3,
    .irq = I2C3_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C3,
    .sda_port = GPIOC,
    .sda_pin = GPIO_PIN_1,
    .scl_alternate = GPIO_AF4_I2C3,
    .scl_port = GPIOC,
    .scl_pin = GPIO_PIN_0,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
};

uint8_t NB_I2C_INSTANCES = sizeof(g_i2c_init_info) / sizeof(g_i2c_init_info[0]);


uart_conf_t g_uart_config[] = {
  {
    //UART ID and IRQ
    .usart_typedef = USART1, .irqtype = USART1_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_9,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_10,
    .uart_af_remap = GPIO_AF7_USART1,
    .tx_alternate  = GPIO_AF7_USART1,
    .rx_alternate  = GPIO_AF7_USART1,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART2, .irqtype = USART2_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_2,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_3,
    .uart_af_remap = GPIO_AF7_USART2,
    .tx_alternate  = GPIO_AF7_USART2,
    .rx_alternate  = GPIO_AF7_USART2,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART3, .irqtype = USART3_IRQn,
    .tx_port = GPIOC, .tx_pin = GPIO_PIN_4,
    .rx_port = GPIOC, .rx_pin = GPIO_PIN_5,
    .uart_af_remap = GPIO_AF7_USART3,
    .tx_alternate  = GPIO_AF7_USART3,
    .rx_alternate  = GPIO_AF7_USART3,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
};

uint8_t NB_UART_MANAGED = sizeof(g_uart_config) / sizeof(g_uart_config[0]);

UART_HandleTypeDef g_UartHandle[sizeof(g_uart_config) / sizeof(g_uart_config[0])];


#define SAMPLINGTIME  ADC_SAMPLETIME_1CYCLE_5  /*!< ADC conversions sampling time. */

